samdonnelly/STM32F4-driver-test/sources/app_test/active_object_test.cpp
#elif AO_C_TEST 

//=======================================================================================
// C System 

//==================================================
// General 

// Setup 
void AOSystemInit(void); 

//==================================================

//==================================================
// Low Priority Thread module data 

// Low Priority Thread states 
typedef enum {
    THREAD_LOW_SERIAL_OUT_STATE, 
    THREAD_LOW_SERIAL_IN_STATE, 
    THREAD_LOW_NUM_STATES 
} ThreadLowStates; 

// Low Priority Thread event indexes 
typedef enum {
    THREAD_LOW_NO_EVENT, 
    THREAD_LOW_SERIAL_OUT_EVENT, 
    THREAD_LOW_SERIAL_IN_EVENT 
} ThreadLowEvents; 


// Low Priority Thread trackers 
struct ThreadLowTrackers 
{
    // System info 
    ThreadEventData event_data; 
    ThreadLowStates state; 

    // Serial terminal data 
    USART_TypeDef *uart; 
    DMA_Stream_TypeDef *dma_stream; 
    uint8_t cb[SERIAL_INPUT_MAX_LEN];          // Circular buffer populated by DMA 
    cb_index_t cb_index;                      // Circular buffer indexing info 
    dma_index_t dma_index;                    // DMA transfer indexing info 
    uint8_t data_buff[SERIAL_INPUT_MAX_LEN];   // Buffer that stores latest UART input 

    // State flags 
    uint8_t state_entry : 1; 
    uint8_t serial_out  : 1; 
    uint8_t serial_in   : 1; 
}; 

// Low Priority Thread object 
static ThreadLowTrackers thread_low_trackers; 


// Queue info 
static const uint8_t thread_low_queue_len = 3; 

// State function pointers 
typedef void (*thread_low_state_ptr)(ThreadLowTrackers *trackers, Event event); 

// Dispatch functions 
void DispatchThreadLow(Event event); 

// State functions 
void ThreadLowState0(ThreadLowTrackers *trackers, Event event); 
void ThreadLowState1(ThreadLowTrackers *trackers, Event event); 

// Low Priority Thread state table 
static const thread_low_state_ptr thread_low_state_table[THREAD_LOW_NUM_STATES] = 
{
    &ThreadLowState0,   // State 0 
    &ThreadLowState1    // State 1 
}; 

//==================================================


//==================================================
// High Priority Thread module data 

// High Priority thread states 
typedef enum {
    THREAD_HIGH_LED_SLOW_STATE, 
    THREAD_HIGH_LED_FAST_STATE, 
    THREAD_HIGH_NUM_STATES 
} ThreadHighStates; 

// High Priority Thread event indexes 
typedef enum {
    THREAD_HIGH_NO_EVENT, 
    THREAD_HIGH_LED_TOGGLE_EVENT 
} ThreadHighEvents; 


// High Priority Thread trackers 
struct ThreadHighTrackers 
{
    // System info 
    ThreadEventData event_data; 
    ThreadHighStates state; 

    // LED timers 
    TimerHandle_t slow_blink_timer; 
    TimerHandle_t fast_blink_timer; 

    // LED pin data 
    GPIO_TypeDef *led_gpio; 
    gpio_pin_num_t led_pin; 
    gpio_pin_state_t led_state; 

    // State flags 
    uint8_t state_entry  : 1; 
    uint8_t state_change : 1; 
    uint8_t led_slow     : 1; 
    uint8_t led_fast     : 1; 
}; 

// High Priority Thread object 
static ThreadHighTrackers thread_high_trackers; 


// Queue info 
static const uint8_t thread_high_queue_len = 3; 

// State function pointers 
typedef void (*thread_high_state_ptr)(ThreadHighTrackers *trackers, Event event);  

// Dispatch functions 
void DispatchThreadHigh(Event event); 

// State functions 
void ThreadHighState0(ThreadHighTrackers *trackers, Event event); 
void ThreadHighState1(ThreadHighTrackers *trackers, Event event); 

// High Priority Thread state table 
static const thread_high_state_ptr thread_high_state_table[THREAD_HIGH_NUM_STATES] = 
{
    &ThreadHighState0,   // State 0 
    &ThreadHighState1    // State 1 
}; 

// Helper functions 
void ThreadHighStateToggle(void); 
void ThreadHighStateTrigger(void); 

//==================================================


//==================================================
// Software Timer Thread 

// Called when LED toggle timers expire 
void LEDTimerCallback(TimerHandle_t xTimer); 

//==================================================

//=======================================================================================

#endif 

//=======================================================================================
// Event module(s) 

// In practice these would be independent modules that can be used wherever needed. 

/**
 * @brief Event: Serial Output 
 * 
 * @param output_buff : data to output 
 */
void SerialOutEvent(char *output_buff); 

/**
 * @brief Event: Serial Input 
 * 
 * @param dma_stream : DMA stream to use 
 * @param dma_index : dma transfer index info 
 * @param cb_index : circular buffer index info 
 * @param cb : circular buffer 
 * @param data_buff : buffer to store parsed circular buffer input 
 */
void SerialInEvent(
    DMA_Stream_TypeDef *dma_stream, 
    dma_index_t *dma_index, 
    cb_index_t *cb_index, 
    uint8_t *cb, 
    uint8_t *data_buff); 

/**
 * @brief Event: Pin Toggle (used to toggle the board LED) 
 * 
 * @param pin_gpio : pin GPIO port 
 * @param pin_num : pin number 
 * @param pin_state : state of the pin (high/low) 
 */
void PinToggleEvent(
    GPIO_TypeDef *pin_gpio, 
    gpio_pin_num_t pin_num, 
    gpio_pin_state_t *pin_state); 

//=======================================================================================


//=======================================================================================
// Test functions 

// Active Object test setup code 
void active_object_test_init(void)
{
    // Initialize FreeRTOS scheduler 
    osKernelInitialize(); 

#if AO_CPP_TEST 
    system_data.SystemDataInit(); 
#elif AO_C_TEST 
    AOSystemInit(); 
#endif 
}


// Active Object test code 
void active_object_test_app(void)
{
    // Start scheduler 
    osKernelStart(); 
}

//=======================================================================================


//=======================================================================================
// Setup 

#if AO_CPP_TEST 

void SystemData::SystemDataInit(void)
{
    // Initialize GPIO ports 
    gpio_port_init(); 

    //==================================================
    // Low Priority Thread 

    // Initialize UART 
    uart_init(
        USART2, 
        GPIOA, 
        PIN_3, 
        PIN_2, 
        UART_FRAC_42_9600, 
        UART_MANT_42_9600, 
        UART_DMA_DISABLE, 
        UART_DMA_ENABLE);   // RX DMA enabled for serial terminal reading 
    
    // Enable IDLE line interrupts for reading serial terminal input with DMA 
    uart_interrupt_init(
        USART2, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE, 
        UART_INT_ENABLE, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE); 

    // Initialize the DMA stream 
    dma_stream_init(
        DMA1, 
        DMA1_Stream5, 
        DMA_CHNL_4, 
        DMA_DIR_PM, 
        DMA_CM_ENABLE,
        DMA_PRIOR_VHI, 
        DMA_DBM_DISABLE, 
        DMA_ADDR_INCREMENT,   // Increment the buffer pointer to fill the buffer 
        DMA_ADDR_FIXED,       // No peripheral increment - copy from DR only 
        DMA_DATA_SIZE_BYTE, 
        DMA_DATA_SIZE_BYTE); 

