samdonnelly/STM32F4-driver-test/sources/app_test/active_object_test.cpp
    // Initialize interrupt handler flags and enable the interrupt handler 
    int_handler_init(); 
    nvic_config(USART2_IRQn, EXTI_PRIORITY_15); 

    // Initialize general data 
    thread_low_trackers.state = THREAD_LOW_SERIAL_OUT_STATE; 

    thread_low_trackers.uart = USART2; 
    thread_low_trackers.dma_stream = DMA1_Stream5; 
    memset((void *)thread_low_trackers.cb, CLEAR, sizeof(thread_low_trackers.cb)); 
    thread_low_trackers.cb_index.cb_size = SERIAL_INPUT_MAX_LEN; 
    thread_low_trackers.cb_index.head = CLEAR; 
    thread_low_trackers.cb_index.tail = CLEAR; 
    thread_low_trackers.dma_index.data_size = CLEAR; 
    thread_low_trackers.dma_index.ndt_old = dma_ndt_read(thread_low_trackers.dma_stream); 
    thread_low_trackers.dma_index.ndt_new = CLEAR; 
    memset((void *)thread_low_trackers.data_buff, CLEAR, sizeof(thread_low_trackers.data_buff)); 
    
    thread_low_trackers.state_entry = SET_BIT; 
    thread_low_trackers.serial_out = SET_BIT; 
    thread_low_trackers.serial_in = CLEAR_BIT; 

    // Thread definition, queue handle creation and dispatch function assignment 
    thread_low_trackers.event_data = 
    {
        .attr = { .name = "ThreadLow", 
                  .attr_bits = CLEAR, 
                  .cb_mem = NULL, 
                  .cb_size = CLEAR, 
                  .stack_mem = NULL, 
                  .stack_size = THREAD_LOW_STACK_SIZE, 
                  .priority = (osPriority_t)osPriorityLow, 
                  .tz_module = CLEAR, 
                  .reserved = CLEAR }, 
        .event = CLEAR, 
        .ThreadEventQueue = xQueueCreate(thread_low_queue_len, sizeof(uint32_t)), 
        .dispatch = DispatchThreadLow 
    }; 
    // Check that the queues were created successfully 

    // Create the thread(s) 
    osThreadNew(
        eventLoop, 
        (void *)&thread_low_trackers.event_data, 
        &thread_low_trackers.event_data.attr); 
    // Check that the thread creation worked 

    uart_send_str(USART2, "\r\n>>> "); 

    //==================================================

    //==================================================
    // High Priority Thread 

    // Initialize general data 
    thread_high_trackers.state = THREAD_HIGH_LED_SLOW_STATE; 
    thread_high_trackers.led_gpio = GPIOA; 
    thread_high_trackers.led_pin = GPIOX_PIN_5; 
    thread_high_trackers.led_state = GPIO_LOW; 
    thread_high_trackers.state_entry = SET_BIT; 
    thread_high_trackers.state_change = CLEAR_BIT; 
    thread_high_trackers.led_slow = SET_BIT; 
    thread_high_trackers.led_fast = CLEAR_BIT; 

    // Initialize board LED (on when logic low) 
    gpio_pin_init(GPIOA, PIN_5, MODER_GPO, OTYPER_PP, OSPEEDR_HIGH, PUPDR_NO); 

    // Thread definition, queue handle creation and dispatch function assignment 
    thread_high_trackers.event_data = 
    {
        .attr = { .name = "ThreadHigh", 
                  .attr_bits = CLEAR, 
                  .cb_mem = NULL, 
                  .cb_size = CLEAR, 
                  .stack_mem = NULL, 
                  .stack_size = THREAD_HIGH_STACK_SIZE, 
                  .priority = (osPriority_t)osPriorityHigh, 
                  .tz_module = CLEAR, 
                  .reserved = CLEAR }, 
        .event = THREAD_HIGH_NO_EVENT, 
        .ThreadEventQueue = xQueueCreate(thread_high_queue_len, sizeof(uint32_t)), 
        .dispatch = DispatchThreadHigh 
    }; 
    // Check that the queues were created successfully 

    // Create the thread(s) 
    osThreadNew(
        eventLoop, 
        (void *)&thread_high_trackers.event_data, 
        &thread_high_trackers.event_data.attr); 
    // Check that the thread creation worked 

    // Queue and empty event to start the LED blinks 
    xQueueSend(thread_high_trackers.event_data.ThreadEventQueue, 
        (void *)&thread_high_trackers.event_data.event, 0); 
    
    //==================================================

    //==================================================
    // Software Timer Thread 

    // Create timers 
    thread_high_trackers.slow_blink_timer = xTimerCreate(
        "slow_blink_timer",             // Name of timer 
        LED_SLOW_BLINK_PERIOD,          // Period of timer (ticks) 
        pdTRUE,                         // Auto-relead --> pdTRUE == Repeat Timer 
        (void *)0,                      // Timer ID 
        LEDTimerCallback);              // Callback function 
    thread_high_trackers.fast_blink_timer = xTimerCreate(
        "fast_blink_timer",             // Name of timer 
        LED_FAST_BLINK_PERIOD,          // Period of timer (ticks) 
        pdTRUE,                         // Auto-relead --> pdTRUE == Repeat Timer 
        (void *)1,                      // Timer ID 
        LEDTimerCallback);              // Callback function 
    // Check that timers were created successfully 

    //==================================================
}

#endif 

//=======================================================================================


//=======================================================================================
// Low Priority Thread control 

// Each thread can be separated into its own file to help organize the code. The thread 
// would considt primarily of the dispatch function and each state function. 
// A Dispatch function does not necessarily need a state machine. It can consist of only 
// the events available to that entire thread. For example, the high priority thread 
// could be dedicated to reading data from devices irrespective of state and each read 
// gets triggered by a timer. 

#if AO_CPP_TEST 

// Low Priority Thread: Dispatch 
void SystemData::DispatchThreadLow(Event event)
{
    ThreadLowStates state = system_data.thread_low_state; 

    // Continuous events. These are thread events that happen irrespective of state. 

    // State machine 
    switch (state)
    {
        case ThreadLowStates::SERIAL_OUT_STATE: 
            if (system_data.thread_low_flags.serial_in)
            {
                state = ThreadLowStates::SERIAL_IN_STATE; 
            }
            break; 
        
