samdonnelly/STM32F4-driver-test/sources/app_test/active_object_test.cpp
        case ThreadLowStates::SERIAL_IN_STATE: 
            if (system_data.thread_low_flags.serial_out)
            {
                state = ThreadLowStates::SERIAL_OUT_STATE; 
            }
            break; 

        default: 
            state = ThreadLowStates::SERIAL_OUT_STATE; 
            break; 
    }

    // Run state function 
    system_data.thread_low_state_table[(uint8_t)state](&system_data, event); 
    system_data.thread_low_state = state; 
}

// Low Priority Thread: State 0 
void SystemData::ThreadLowState0(
    SystemData *data, 
    Event event)
{
    // State entry 
    if (data->thread_low_flags.state_entry)
    {
        data->thread_low_flags.state_entry = CLEAR_BIT; 
    }

    data->thread_low_event = (ThreadLowEvents)event; 

    // Event selection 
    switch (data->thread_low_event)
    {
        case ThreadLowEvents::SERIAL_OUT_EVENT: 
            SerialOutEvent((char *)data->user_in_buff); 
            break; 

        default: 
            break; 
    }

    // State exit 
    if (data->thread_low_flags.serial_in)
    {
        data->thread_low_flags.state_entry = SET_BIT; 
        data->thread_low_flags.serial_out = CLEAR_BIT; 
    }
}

// Low Priority Thread: State 1 
void SystemData::ThreadLowState1(
    SystemData *data, 
    Event event)
{
    // State entry 
    if (data->thread_low_flags.state_entry)
    {
        data->thread_low_flags.state_entry = CLEAR_BIT; 
    }

    data->thread_low_event = (ThreadLowEvents)event; 

    // Event selection 
    switch (data->thread_low_event)
    {
        case ThreadLowEvents::SERIAL_IN_EVENT: 
            SerialInEvent(
                data->dma_stream, 
                &data->dma_index, 
                &data->cb_index, 
                data->cb, 
                data->data_buff); 

            // Toggle the high priority thread state 
            data->thread_high_flags.state_change = SET_BIT; 
            
            // Trigger the next state and event 
            data->thread_low_flags.serial_out = SET_BIT; 
            data->thread_low_event_data.event = (Event)ThreadLowEvents::SERIAL_OUT_EVENT; 
            xQueueSend(data->thread_low_event_data.ThreadEventQueue, 
                       (void *)&data->thread_low_event_data.event, 0); 
            break; 

        default: 
            break; 
    }

    // State exit 
    if (data->thread_low_flags.serial_out)
    {
        data->thread_low_flags.state_entry = SET_BIT; 
        data->thread_low_flags.serial_in = CLEAR_BIT; 
    }
}

// Serial Interrupt 
void SystemData::SerialInterrupt(void)
{
    BaseType_t task_woken = pdFALSE; 

    // Trigger a state change and queue a serial input event 
    thread_low_flags.serial_out = CLEAR_BIT; 
    thread_low_flags.serial_in = SET_BIT; 
    thread_low_flags.state_entry = SET_BIT; 

    thread_low_event_data.event = (Event)ThreadLowEvents::SERIAL_IN_EVENT; 
    xQueueSendFromISR(thread_low_event_data.ThreadEventQueue, 
                      (void *)&thread_low_event_data.event, &task_woken); 
}

#elif AO_C_TEST 

// Dispatch function for low priority thread 
void DispatchThreadLow(Event event)
{
    ThreadLowStates state = thread_low_trackers.state; 

    // Continuous events. These are thread events that happen irrespective of state. 

    // State machine 
    switch (state)
    {
        case THREAD_LOW_SERIAL_OUT_STATE: 
            if (thread_low_trackers.serial_in)
            {
                state = THREAD_LOW_SERIAL_IN_STATE; 
            }
            break; 
        
        case THREAD_LOW_SERIAL_IN_STATE: 
            if (thread_low_trackers.serial_out)
            {
                state = THREAD_LOW_SERIAL_OUT_STATE; 
            }
            break; 

        default: 
            state = THREAD_LOW_SERIAL_OUT_STATE; 
            break; 
    }

    // Run state function 
    thread_low_state_table[state](&thread_low_trackers, event); 
    thread_low_trackers.state = state; 
}


// Low Priority Thread: State 0 
void ThreadLowState0(
    ThreadLowTrackers *trackers, 
    Event event)
{
    // State entry 
    if (thread_low_trackers.state_entry)
    {
        thread_low_trackers.state_entry = CLEAR_BIT; 
    }

    // Event selection 
    switch (event)
    {
        case THREAD_LOW_SERIAL_OUT_EVENT: 
            SerialOutEvent((char *)thread_low_trackers.user_in_buff); 
            break; 

        default: 
            break; 
    }

    // State exit 
    if (thread_low_trackers.serial_in)
    {
        thread_low_trackers.state_entry = SET_BIT; 
        thread_low_trackers.serial_out = CLEAR_BIT; 
    }
}


// Low Priority Thread: State 1 
void ThreadLowState1(
    ThreadLowTrackers *trackers, 
    Event event)
{
    // State entry 
    if (thread_low_trackers.state_entry)
    {
        thread_low_trackers.state_entry = CLEAR_BIT; 
    }

    // Event selection 
    switch (event)
    {
        case THREAD_LOW_SERIAL_IN_EVENT: 
            SerialInEvent(
                thread_low_trackers->dma_stream, 
                &thread_low_trackers->dma_index, 
                &thread_low_trackers->cb_index, 
                thread_low_trackers->cb, 
                thread_low_trackers->data_buff); 

            // Toggle the high priority thread state 
            ThreadHighStateToggle(); 
            
            // Trigger the next state and event 
            thread_low_trackers.serial_out = SET_BIT; 
            thread_low_trackers.event_data.event = THREAD_LOW_SERIAL_OUT_EVENT; 
            xQueueSend(thread_low_trackers.event_data.ThreadEventQueue, 
                       (void *)&thread_low_trackers.event_data.event, 0); 
            break; 

        default: 
            break; 
    }

    // State exit 
    if (thread_low_trackers.serial_out)
    {
        thread_low_trackers.state_entry = SET_BIT; 
        thread_low_trackers.serial_in = CLEAR_BIT; 
    }
}

#endif 

#if INTERRUPT_OVERRIDE 

// USART2 interrupt - overridden 
void USART2_IRQHandler(void)
{
    handler_flags.usart2_flag = SET_BIT; 

#if AO_CPP_TEST 

